[
  {
    "thoughtText": "Manchester City fought back from two goals down at half-time to draw 2-2 at West Ham United and ensure that they top the table going into the final day of the Premier League season, but it could have been so much better. Two goals from Jarrod Bowen had put West Ham in charge at the London Stadium but a Jack Grealish volley and a Vladimir Coufal own goal brought City level. They even had a chance to claim a first win under Pep Guardiola, after having been two goals down, when they were awarded a late penalty. However, Riyad Mahrez saw his spot-kick brilliantly saved by Lukasz Fabianski. It means that Liverpool travel to Southampton on Tuesday evening knowing they must avoid defeat to keep the title race going to the final Sunday. Victory at St Mary's for Saturday's FA Cup winners would close the gap to a point and put the pressure back on the champions. ",
    "thoughtAuthor": "Brian Kernighan"
  },
  {
    "thoughtText": "Everton conceded two goals in two minutes and were awarded two red cards to give Brentford a 3-2 win, missing the chance to secure their Premier League status. Dominic Calvert-Lewin scored his first goal since August when getting a slight touch on Richarlison's goalbound effort in the 10th minute. Jarrad Branthwaite was sent off for bringing down Ivan Toney as the last man eight minutes later. An own goal from Seamus Coleman got Brentford level, but Richarlison put Everton back in front with a penalty in first-half stoppage time. But Yoane Wissa and Rico Henry struck in quick succession to turn the match on its head. Everton finished with nine men when substitute Salomon Rondon was dismissed for a reckless challenge. The Toffees remain 16th on 36 points with two matches left, while Brentford rise to 11th and on 46 points.",
    "thoughtAuthor": "Jackson Smith"
  },
  {
    "thoughtText": "Riyad Mahrez missed a late penalty for Manchester City, who had to settle for a point as they came from two goals down to draw 2-2 at West Ham United. West Ham went ahead on 24 minutes through Jarrod Bowen, who took Pablo Fornals' pass round Ederson to score. Bowen doubled the lead just before the break, latching on to Michail Antonio's pass to fire into the bottom corner. Jack Grealish pulled one back for City four minutes after the break with a right-footed volley that was deflected in. They were level when Mahrez's cross was headed into his own net by Vladimir Coufal on 69 minutes. City had the chance to go six points clear of Liverpool from the penalty spot after Gabriel Jesus had been brought down by Craig Dawson, but Mahrez's spot-kick was saved by Lukasz Fabianski. City are on 90 points, four above Liverpool, who play Southampton on Tuesday, before each side play their final match of the season on 22 May.",
    "thoughtAuthor": "John Jones"
  },
  {
    "thoughtText": "Substitute Pascal Struijk scored a dramatic equaliser in added time as Leeds United moved out of the relegation zone with a 1-1 draw against Brighton & Hove Albion. Although Leeds came flying out of the traps Brighton went ahead on 21 minutes with a sublime chipped finish by Danny Welbeck. Raphinha's 66th-minute free-kick crashed against the woodwork, before Jack Harrison, Mateusz Klich and Joe Gelhardt all peppered the Seagulls goal. With the match into the second minute of added time, Struijk met Gelhardt's cross at the far post to head in for a priceless point. Leeds' first point in four matches lifts them to 17th on 35 points, a place and a point above Burnley, who have a match in hand and a superior goal difference. Brighton are 10th on 48 points.",
    "thoughtAuthor": "Harry Bunda"
  },
  {
    "thoughtText": "Jamie Vardy and Harvey Barnes each scored twice as Leicester City came from behind to beat Watford 5-1 and move into the top half of the table. Watford took a sixth-minute lead through Joao Pedro's deflected shot. After Watford struck the bar, Leicester scored twice in quick succession. James Maddison profited from a defensive mix-up on 18 minutes to level, before the midfielder's cross was headed in by Vardy in the 22nd minute. Barnes extended Leicester's advantage a minute into the second half, with a brilliant first-time finish from a Marc Albrighton centre. Vardy's second came on 70 minutes, bringing down Barnes' lofted ball to beat Ben Foster. Barnes completed the scoring with a first-time strike as Leicester moved to ninth on 48 points. Watford stay 19th with 23 points.",
    "thoughtAuthor": "Pinta Ajuaze"
  },
  {
    "thoughtText": "Substitute Jeffrey Schlupp stepped off the bench to score a late equaliser as Crystal Palace fought back to secure a 1-1 draw at Aston Villa. In an entertaining match, Villa's Danny Ings twice went close in the opening stages, stabbing a first-time effort wide from John McGinn's cross and then volleying narrowly over. Palace had chances too, the best of which was Nathaniel Clyne being denied by goalkeeper Emiliano Martinez. Ollie Watkins fired Villa ahead with a crisp finish from Lucas Digne's inviting 69th-minute delivery, but, with nine minutes remaining, Schlupp slid home his fourth goal of the season. Palace are 12th on 45 points, one place and a point ahead of Villa.",
    "thoughtAuthor": "Ollie Stromna"
  },
  {
    "thoughtText": "Wolverhampton Wanderers' European ambitions are over after they were held to a 1-1 draw by Norwich City. Teemu Pukki scored his 11th league goal of the season, firing his effort through the legs of Wolves captain Conor Coady on 37 minutes to put Norwich in front. Rayan Ait-Nouri pulled Wolves level 10 minutes after the break with his first goal of the campaign, heading in from close range. Norwich, who are already relegated, remain bottom with 22 points. Wolves are eighth on 51 points, five behind West Ham United and therefore unable to qualify for next season's UEFA Europa Conference League.",
    "thoughtAuthor": "Sippo Crates"
  },
  {
    "thoughtText": "Harry Kane's first-half penalty was enough for Tottenham Hotspur to beat Burnley 1-0 and move back into the top four. Spurs started strongly, with Son Heung-min forcing a fine save from Nick Pope before Nathan Collins cleared Kane's effort off the line. In the eighth minute of first-half stoppage time, Spurs took the lead through Kane's spot-kick, his second of the week, awarded after a VAR review for a handball by Ashley Barnes. Barnes almost equalised for Burnley on 62 minutes, but his 20-yard strike hit the outside of a post. Spurs pressed for a second, but found Pope in inspired form as he made two stunning stops to deny Son. A third win in four takes Spurs to 68 points, two ahead of Arsenal, who play Newcastle United on Monday. Burnley are 18th on 34 points, a point and a place behind Leeds United, over whom they have a match in hand.",
    "thoughtAuthor": "Treast Grunge"
  }
]
